program(0, -1, 3)
program(0, -2, 3)
program(0, 0, 3)
program(0, 1, 3)
program(0, 2, 3)
program(0, 4, 3)
program(0, 7, 3)
program(0, 10, 3)
program(0, -3, 3)
program(0, -1, 3, true)
program(0, -2, 3, true)
program(0, 0, 3, true)
program(0, 1, 3, true)
program(0, 2, 3, true)
program(0, 4, 3, true)
program(0, 10, 3, true)
program(0, -3, 3, true)
